absorbing
big
budget
bland
bloody
boring
bad
worse
worst
great
better
best
brutal
soporific
charismatic
charming
clever
cliche ridden
comical
confused
dazzling
disappointing
disgusting
distasteful
dramatic
dreadful
resonant
enjoyable
fantasy
fascinating
fast
moving
first-rate
first
rate
flawed
highly
charged
hilarious
imaginative
impassioned
important
incredible
independent
infused
insightful
inspirational
inspired
intellectual
invigorating
intelligent
intense
intensive
interesting
intriguing
introspective
intuitive
inventive
inventively edited
ironic
juvenile
layered
legendary
light
hearted
low-budget
low
magical
magnetic
mature
meaningful
memorable
mind
blowing
modern
moronic
must
see
mysterious
mystical
narrative
non-stop
non
stop
oddball
offbeat
ordinary
original
outdated
passionate
phenomenal
picaresque
playful
pleasant
plot
driven
ponderous
popular
pornographic
potent
powerful
predictable
profound
provoking
pure
quirky
rated
realistic
recommended
refined
refreshing
relevant
remarkable
resourceful
revealing
rich
riveting
romantic
rousing
sad
sappy
satirical
second
senseless
sensitive
sentimental
silly
slow
small
star
studded
static
strong
stunning
stupid
superb
surprising
suspenseful
sweet
tender
theatrical
third-rate
third
thought
thrilling
tired
touching
trite
underground
uneven
unforgettable
forgettable
uninteresting
unpretentious
pretentious
uproarious
uproar
violent
visionary
visual
wacky
weak
well
paced
worthwhile
average
brilliant
cliched
dull
entertaining
excellent
exciting
expensive
funny
incredibly
tiresome
lasting
questionable
ripping
second-rate
unoriginal
tragic
uplifting
cliché
afraid
angry
annoyed
anxious
arrogant
ashamed
awful
bewildered
bored
concerned
condemned
creepy
cruel
dangerous
defeated
defiant
depressed
disgusted
disturbed
doubtful
eerie
embarrassed
envious
evil
fierce
foolish
frantic
frightened
grieving
guilty
helpless
hungry
hurt
ill
jealous
lonely
mad
naughty
nervous
obnoxious
outrageous
panicky
repulsive
safe
scared
shy
sleepy
sleep
sore
strange
tense
terrible
troubled
unusual
upset
uptight
weary
wicked
worried
alright
calm
different
fair
fine
ok
puzzled
agreeable
alert
amused
brave
bright
cheerful
comfortable
cooperative
courageous
delightful
determined
eager
elated
enchanting
encouraging
energetic
enthusiastic
excited
exuberant
faithful
fantastic
friendly
frowning
gentle
glorious
good
happy
healthy
helpful
innocent
jolly
kind
lively
lovely
lucky
obedient
perfect
proud
relaxed
relieved
smiling
splendid
successful
thoughtful
victorious
vivacious
witty
wonderful
adorable
beautiful
blonde
blushing
clean
clear
cloudy
colourful
crowded
curious
cute
dark
dirty
drab
distinct
elegant
fancy
filthy
glamorous
gleaming
graceful
grotesque
homely
misty
motionless
muddy
plain
poised
quaint
scary
shiny
smoggy
sparkling
spotless
stormy
ugly
unsightly